package Lesson1;

public class Compare {
    public static void main(String[] args) {
        /**
         * Даны переменные a = 5 и b = 12.
         * Создать переменную логического типа check, которая будет содержать результат сравнения переменных a и b.
         * Вывести в консоль переменную check
         */

        int a = 5, b = 12;
        boolean check = a > b;
        System.out.println("a > b = " + check);
    }
}
